#+TITLE: emacs-lisp
#+DATE: <2016-11-02 Wed>
#+AUTHOR: Jezrael Arciaga
#+EMAIL: jezarciaga@gmail.com
#+OPTIONS: ':nil *:t -:t ::t <:t H:1 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:nil todo:t |:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.1.1 (Org mode 8.3.6)


*** DONE Use =if= and =get-buffer= to write a function that prints a message telling you whether a buffer exists
    CLOSED: [2016-11-13 Sun 21:33]

#+BEGIN_SRC elisp
  (defun jez/buffer-exists (buffer)
    "Prints in mini-buffer if `buffer` exists"
    (interactive
     (list (read-buffer "Input buffer name:"
                        (other-buffer (current-buffer)))))
    (let* ((buffer-names (mapcar 'buffer-name (buffer-list))))
      (if (member buffer buffer-names)
          (message (format "Buffer: %s exists" buffer))
        (message (format "Buffer: %s doesn't exists" buffer)))))
  (jez/buffer-exists "non-existing-buffer")
#+END_SRC

#+RESULTS:
: Buffer: non-existing-buffer doesn’t exists

(buffer-name (car (buffer-list)))
(member "test" (mapcar 'buffer-name (buffer-list)))
#+RESULTS:
: non existing buffer buffer exists


- [X] learn interactive mode
- [X] how it works
- [X] what are the codes like =p= =P=
- [X] read-buffer not working in interactive mode
- [X] append-to-buffer example seems to work using read-buffer

*** =save-restriction= special form

#+BEGIN_SRC elisp
  (save-restriction
    (let* ((point-before (point-min))
           point-after)
      (widen)
      (setq point-after (point-min))
      (message "before: %s, after: %s" point-before point-after)))
#+END_SRC
#+RESULTS:
: before: 14911, after: 1

** DONE search-forward
   CLOSED: [2016-11-24 Thu 23:23]

#+BEGIN_SRC elisp
  (search-forward "END_SRC")
#+END_SRC

#+RESULTS:
: 19031


*** What does the ‘more-flowers’ list now contain?

#+BEGIN_SRC elisp :results raw
  (setq flowers (list "flowers" "violet" "buttercup"))
  (setq flowers (cons "another flower" flowers))
  (setq flowers (cons "and another flower" flowers))
  (cons "fish" (cdr flowers))
#+END_SRC

#+RESULTS:
(fish another flower flowers violet buttercup)
*** Loop
#+BEGIN_SRC elisp
  (defun jez/test-while ()
    "docstring"
    (interactive)
    (setq animals '("tiger" "lion" "cat" "dog"))
    (while animals
      (print (car animals))
      (setq animals (cdr animals))))
#+END_SRC
#+RESULTS:
: jez/test-while

#+BEGIN_SRC elisp
  (defun jez/sum-of-consecutive (number)
    "Return total of numbers from 1 to NUMBER"
    (interactive "nEnter a number: ")
    (let ((sum 0)
          (counter 1))
      (while (<= counter number)
        (setq sum (+ counter sum))
        (setq counter (+ counter 1)))
      (print sum)))
#+END_SRC
#+RESULTS:
: jez/sum-of-consecutive



#+BEGIN_SRC elisp
  (defun jez/reverse-list (list)
    "Reverse the LIST"
    (let* (list-new)
      (dolist (element list list-new)
        (setq list-new (cons element list-new)))))
  (jez/reverse-list '("a" "b" "c" "d" "e"))
#+END_SRC
#+RESULTS:
| e | d | c | b | a |

#+BEGIN_SRC elisp
  (let* ((total 0))
    (dotimes (element 5 total)
      (setq total (+ element total))))
#+END_SRC
#+RESULTS:
: 10

*** Recursion

#+BEGIN_SRC elisp :results output
  (defun jez/print-recursive (list)
    "Print the LIST"
    (when list
      (jez/print-recursive (cdr list))
      (print (car list))))
  (jez/print-recursive '("jez" "gonzaga" "arciaga"))
#+END_SRC
#+RESULTS:
: 
: "arciaga"
: 
: "gonzaga"
: 
: "jez"

#+BEGIN_SRC elisp
  (defun jez/triangle-recursive (number)
    "Return sum of numbers from 1 to NUMBER"
    (if (< 0 number)
        (+ number (jez/triangle-recursive (1- number)))
      0))
  (jez/triangle-recursive 7)
#+END_SRC
#+RESULTS:
: 28


